In [5]:
numbers = [1, 2, 3, 4, 5]

# for i in numbers:
#     print(i)

for i in range(1,6):
    print(i)

print(numbers)

1
2
3
4
5
[1, 2, 3, 4, 5]

In [6]:
simpsons = {'Dad': 'Homer',
            'Mum': 'Marge',
            'Baby': 'Maggie'}

for family_member, name in simpsons.items():
    print(f'{name} is the {family_member}')

Homer is the Dad
Marge is the Mum
Maggie is the Baby

In [7]:
side_characters = ['Barney', 'Ned', 'Krusty', 'Sideshow Bob']
print(side_characters[1:3])

['Ned', 'Krusty']

In [8]:
side_characters = ['Barney', 'Ned', 'Krusty', 'Sideshow Bob']

for i, name in enumerate(side_characters):
    side_characters[i] = f'{name} Simpson'

print(side_characters)

['Barney Simpson', 'Ned Simpson', 'Krusty Simpson', 'Sideshow Bob Simpson']

In [9]:
import pandas as pd

df_1 = pd.DataFrame({'Col 1':['foo','bar','baz'],
                     'col 2':[1, 2, 3]})

df_2 = pd.DataFrame({'col 1':['Thing 1', 'Thing 2', 'Thing 3'],
                     'col 2': ['Green', 'Eggs', 'Ham']})

df_dict = {'Dataframe 1':df_1,
           'Dataframe 2':df_2}

for k, v in df_dict.items():
    v['originator'] = k

df_dict['Dataframe 1']

  Col 1  col 2   originator
0   foo      1  Dataframe 1
1   bar      2  Dataframe 1
2   baz      3  Dataframe 1

In [10]:
import pandas as pd
company_1 = pd.DataFrame({'Name':['Jon','Paul','Emily'],
                     'Job Title':['Reception', 'Cleaner', 'Admin']})

company_2 = pd.DataFrame({'Name':['Thing 1', 'Thing 2', 'Thing 3'],
                     'col 2': ['Green', 'Eggs', 'Ham']})

company_df_dict = {'Dataframe 1':company_1,
           'Dataframe 2':company_2}

for k, v in company_df_dict.items():
    v['originator'] = k

company_df_dict['Dataframe 1']

    Name  Job Title   originator
0    Jon  Reception  Dataframe 1
1   Paul    Cleaner  Dataframe 1
2  Emily      Admin  Dataframe 1

In [19]:
import pandas as pd

child_ident = pd.DataFrame({'child_id': ['child1','child2','child3', 'child4'],
              'age_first_contact':[6, 10, 12, 13],
              'gender':['M','M', 'M', 'F']})

#print(child_ident)

nhs_nums = pd.DataFrame({'child_id':['child1','child2','child3', 'child4'],
                         'nhs_numbers':['nhs1', 'nhs2', 'nhs3', 'nhs4']})

ident_nhs = child_ident.merge(nhs_nums, how='left', left_on='child_id', right_on='child_id')

# ident_nhs = child_identifiers.merge(nhs_nums, how='left', on='child_id')

print(ident_nhs)

  child_id  age_first_contact gender nhs_numbers
0   child1                  6      M        nhs1
1   child2                 10      M        nhs2
2   child3                 12      M        nhs3
3   child4                 13      F        nhs4

In [14]:
x = 1
numbers_list = []

for i in list(range(10)):
    numbers_list.append(x)
    x = (x + numbers_list[i-1])

numbers_list

[1, 2, 3, 5, 8, 13, 21, 34, 55, 89]

In [28]:
import pandas as pd

answers = []
times_tables = {}
for i in list(range(1,11)):
    for j in list(range(1,11)):
        answers.append(i * j)
    times_tables[i] = answers
    answers = []

multiplication_table = pd.DataFrame(times_tables)
multiplication_table.index +=1
multiplication_table

    1   2   3   4   5   6   7   8   9    10
1    1   2   3   4   5   6   7   8   9   10
2    2   4   6   8  10  12  14  16  18   20
3    3   6   9  12  15  18  21  24  27   30
4    4   8  12  16  20  24  28  32  36   40
5    5  10  15  20  25  30  35  40  45   50
6    6  12  18  24  30  36  42  48  54   60
7    7  14  21  28  35  42  49  56  63   70
8    8  16  24  32  40  48  56  64  72   80
9    9  18  27  36  45  54  63  72  81   90
10  10  20  30  40  50  60  70  80  90  100

In [37]:
spreads = ['butter', 'jam', 'peanut butter']
toppings = ['ham', 'cheese', 'sardines']
filling = []
combinations = {}

In [39]:
mixins = []
sandwiches = {}

for spread in spreads:
    for topping in toppings:
        mixins.append(f'{spread} {topping}')
    sandwiches[spread] = mixins
    mixins = []

combinations_df = pd.DataFrame(sandwiches)
combinations_df['topping'] = toppings
combinations_df.set_index('topping', inplace=True)

combinations_df

                   butter           jam           peanut butter
topping
ham            butter ham       jam ham       peanut butter ham
cheese      butter cheese    jam cheese    peanut butter cheese
sardines  butter sardines  jam sardines  peanut butter sardines

In [2]:
import pandas as pd

df = pd.read_csv('/workspaces/ERN-sessions/data/1980 2023 average house prices.csv')
df

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
0,United Kingdom,1980-01,10.11,19273,3.94,28.59
1,United Kingdom,1980-02,10.11,19273,3.94,28.59
2,United Kingdom,1980-03,10.11,19273,3.94,28.59
3,United Kingdom,1980-04,10.51,20044,4.00,24.15
4,United Kingdom,1980-05,10.51,20044,4.00,24.15
...,...,...,...,...,...,...
518,United Kingdom,2023-03,148.20,282548,-1.00,3.20
519,United Kingdom,2023-04,148.90,283871,0.50,2.50
520,United Kingdom,2023-05,149.50,285053,0.40,1.60
521,United Kingdom,2023-06,151.20,288281,1.10,1.90
522,United Kingdom,2023-07,152.00,289824,0.50,0.60

In [6]:
df['Period'] = pd.to_datetime(df['Period'], format='%Y-%m')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 523 entries, 0 to 522
Data columns (total 6 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Name                                            523 non-null    object
 1   Period                                          523 non-null    datetime64[ns]
 2   House price index All property types            523 non-null    float64
 3   Average price All property types                523 non-null    int64
 4   Percentage change (monthly) All property types  523 non-null    float64
 5   Percentage change (yearly) All property types   523 non-null    float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(1)
memory usage: 24.6+ KB

In [13]:
high = df['Average price All property types'].max()
low = df['Average price All property types'].min()
mean = df['Average price All property types'].mean()
median = df['Average price All property types'].median()

house_info_list = [high, low, mean, median]
print(house_info_list)

[292187, 19273, 120570.55831739961, 97964.0]

In [17]:
for info in house_info_list:
    print(info)

292187
19273
120570.55831739961
97964.0

In [22]:
words = ['high', 'low', 'mean', 'median']

for i in [0, 1, 2, 3]:
    print(f'{words[i]}: {house_info_list[i]}')

high: 292187
low: 19273
mean: 120570.55831739961
median: 97964.0

In [26]:
print((1 > 2) & (2 == 2)) # and statement
print((1 > 2) | (2 == 2)) # or statement
print((3 > 2) | (2 == 2))
print((3 > 2) & (2 == 2))

False
True
True
True

In [28]:
print((1 > 3) & (4 == 4))
print((1 > 3) | (4 == 4))

False
True

In [34]:
df_under_mean = df[df['Average price All property types'] < df['Average price All property types'].mean()]
df_under_mean

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
0,United Kingdom,1980-01-01,10.11,19273,3.94,28.59
1,United Kingdom,1980-02-01,10.11,19273,3.94,28.59
2,United Kingdom,1980-03-01,10.11,19273,3.94,28.59
3,United Kingdom,1980-04-01,10.51,20044,4.00,24.15
4,United Kingdom,1980-05-01,10.51,20044,4.00,24.15
...,...,...,...,...,...,...
269,United Kingdom,2002-06-01,59.43,113304,4.09,17.41
270,United Kingdom,2002-07-01,59.90,114214,0.80,14.25
271,United Kingdom,2002-08-01,61.23,116743,2.21,16.78
272,United Kingdom,2002-09-01,62.72,119576,2.43,19.61
273,United Kingdom,2002-10-01,63.19,120486,0.76,22.99

In [38]:
df_under_mean_median = df[(df['Average price All property types'] < df['Average price All property types'].mean()) &
                          (df['Average price All property types'] < df['Average price All property types'].median())] #square brackets outside of the 2 conditions
df_under_mean_median

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
0,United Kingdom,1980-01-01,10.11,19273,3.94,28.59
1,United Kingdom,1980-02-01,10.11,19273,3.94,28.59
2,United Kingdom,1980-03-01,10.11,19273,3.94,28.59
3,United Kingdom,1980-04-01,10.51,20044,4.00,24.15
4,United Kingdom,1980-05-01,10.51,20044,4.00,24.15
...,...,...,...,...,...,...
254,United Kingdom,2001-03-01,48.85,93136,-0.52,10.06
255,United Kingdom,2001-04-01,50.61,96499,3.61,8.15
256,United Kingdom,2001-05-01,50.61,96499,3.61,8.15
257,United Kingdom,2001-06-01,50.61,96499,3.61,8.15
264,United Kingdom,2002-01-01,51.20,97623,-0.35,4.82

In [44]:
over_mean = df['Average price All property types'] > df['Average price All property types'].mean()
under_median = df['Average price All property types'] < df['Average price All property types'].median()

#df_under_mean_median = df[(df['Average price All property types'] < df['Average price All property types'].mean()) &
#                          (df['Average price All property types'] < df['Average price All property types'].median())] 
#df_under_mean_median
# print(under_median)
# print(over_mean)

condition = over_mean | under_median
#print(condition)

df_over_under = df[~condition]
df_over_under

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
258,United Kingdom,2001-07-01,52.43,99971,3.60,9.96
259,United Kingdom,2001-08-01,52.43,99971,3.60,9.96
260,United Kingdom,2001-09-01,52.43,99971,3.60,9.96
261,United Kingdom,2001-10-01,51.38,97964,-2.01,4.63
262,United Kingdom,2001-11-01,51.38,97964,-2.01,4.63
263,United Kingdom,2001-12-01,51.38,97964,-2.01,4.63
265,United Kingdom,2002-02-01,53.06,101164,3.63,8.62
266,United Kingdom,2002-03-01,54.92,104705,3.50,12.42
267,United Kingdom,2002-04-01,55.66,106121,1.35,9.97
268,United Kingdom,2002-05-01,57.09,108852,2.57,12.80
269,United Kingdom,2002-06-01,59.43,113304,4.09,17.41
270,United Kingdom,2002-07-01,59.90,114214,0.80,14.25
271,United Kingdom,2002-08-01,61.23,116743,2.21,16.78
272,United Kingdom,2002-09-01,62.72,119576,2.43,19.61
273,United Kingdom,2002-10-01,63.19,120486,0.76,22.99

In [78]:
monthly_under_mean = df['Percentage change (monthly) All property types'] < df['Percentage change (monthly) All property types'].mean()
yearly_under_median = df['Percentage change (yearly) All property types'] < df['Percentage change (yearly) All property types'].median()

df_both = monthly_under_mean & yearly_under_median
df_change = df[df_both]
df_change

KeyError: 'Percentage change (monthly) All property types'

In [55]:
df = pd.DataFrame({'ChildId':['id1', 'id2', 'id3', 'id4', 'id5'],
                   'Age first contact':[6,12,11,1,19],
                   'Gender':['M','m', 'F', '', 'F' ],
                   'Birthday':['01/01/2002', '02/02/2003', pd.NA, '03/03/2023', '06/01/2012'],
                   'Age':[5,12,11,6,2],
                   'CP Plan?':['Y', 'n', 'N', 'No', 'yES'],})
df['Birthday'] = pd.to_datetime(df['Birthday'], dayfirst=True)
df

  ChildId  Age first contact Gender   Birthday  Age CP Plan?
0     id1                  6      M 2002-01-01    5        Y
1     id2                 12      m 2003-02-02   12        n
2     id3                 11      F        NaT   11        N
3     id4                  1        2023-03-03    6       No
4     id5                 19      F 2012-01-06    2      yES

In [58]:
cond1 = df['Age'] < df['Age first contact']
age_error = df[cond1]
print(age_error)

  ChildId  Age first contact Gender   Birthday  Age CP Plan?
0     id1                  6      M 2002-01-01    5        Y
4     id5                 19      F 2012-01-06    2      yES

In [62]:
cond2 = df['CP Plan?'].str.lower().str.contains('y')
cp_y = df[cond2]
print(cp_y)

  ChildId  Age first contact Gender   Birthday  Age CP Plan?
0     id1                  6      M 2002-01-01    5        Y
4     id5                 19      F 2012-01-06    2      yES

In [66]:
age_error_cp_plan = df[cond1 & cond2] # for readability you can use the actual conditions from above instead of cond1/cond2
age_error_cp_plan

  ChildId  Age first contact Gender   Birthday  Age CP Plan?
0     id1                  6      M 2002-01-01    5        Y
4     id5                 19      F 2012-01-06    2      yES

In [72]:
# if (where something is true, do this)
# else (if the if statement wasn't true, do this)
# elif (else-if - if that wasn't true but this is, do this)
      
# if statement == True:
#      do something

if (1 < 2) == True :
    print('true')
else:
    print('false')

true

In [76]:
list_nums = list(range(1,21,1)) #1 is the default step but can use eg 2

for number in list_nums:
    if number %3 == 0:
        print(f'{number} is divisible by 3')
    else:
        print(f'{number} is not divisible by 3')

1 is not divisible by 3
2 is not divisible by 3
3 is divisible by 3
4 is not divisible by 3
5 is not divisible by 3
6 is divisible by 3
7 is not divisible by 3
8 is not divisible by 3
9 is divisible by 3
10 is not divisible by 3
11 is not divisible by 3
12 is divisible by 3
13 is not divisible by 3
14 is not divisible by 3
15 is divisible by 3
16 is not divisible by 3
17 is not divisible by 3
18 is divisible by 3
19 is not divisible by 3
20 is not divisible by 3

In [80]:
list_nums = list(range(1,21,1)) #1 is the default step but can use eg 2

for number in list_nums:
    if number %2 == 0:
        print(f'{number} is an even number')
    else:
        print(f'{number} is an odd number')

1 is an odd number
2 is an even number
3 is an odd number
4 is an even number
5 is an odd number
6 is an even number
7 is an odd number
8 is an even number
9 is an odd number
10 is an even number
11 is an odd number
12 is an even number
13 is an odd number
14 is an even number
15 is an odd number
16 is an even number
17 is an odd number
18 is an even number
19 is an odd number
20 is an even number

In [89]:
new-nums = list(range(1,21))

for i in new_nums:
    if (i %2 == 0) & (i !=0):
        print(f"{number} it's even and not zero")
    elif (i %2 !=0) & (i %=0) :
        print(f"{number} it's odd and not zero") 
    else
        print('it must be zero')

SyntaxError: cannot assign to expression here. Maybe you meant '==' instead of '='? (2008961295.py, line 1)